<a href="https://colab.research.google.com/github/Jagannath8/GoeduHub-Training/blob/main/Assignment_10.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

# **GO_STP_579 -> Jagannath Pal**

# ***Assignment_10***


---

# One-Hot-Encoding

*   One-hot Encoding is a type of vector representation in which all of the    
elements in a vector are 0, except for one, which has 1 as its value, where 1 represents a boolean specifying a category of the element.
*   One-hot encoding is also called as dummy encoding.

# Multicollinearity


*   Multicollinearity is a serious issue in machine learning models like Linear Regression and Logistic Regression.

*   So, in order to overcome the problem of multicollinearity, one of the dummy variables has to
be dropped.

# Dummy Variable Trap



*   Dummy Variable Trap as the outcome of one variable can easily be predicted with the help
of the remaining variables.
*   Dummy Variable Trap is a scenario in which variables are highly correlated to each other.
*   The Dummy Variable Trap leads to the problem known as Multicollinearity. Multicollinearity
occurs where there is a dependency between the independent features.

# What is Nominal Variables ?

*  Nominal data simply names something without assigning it to an order in relation to other numbered objects or pieces of data.
*  An example of nominal data might be a “pass” or “fail” classification for each student’s test
result. Nominal data provides some information about a group or set of events, even if that information is limited to mere counts.

# What is Ordinal Variables ?

*  Ordinal data, unlike nominal data, involves some order; ordinal numbers stand in relation to
each other in a ranked fashion.
*  For example, suppose you receive a survey from your favorite restaurant that asks you to provide feedback on the service you received. You can rank the quality of service as “1” for poor, “2” for below average, “3” for average, “4” for very good and “5” for excellent. The data collected by this survey are examples of ordinal data. Here the numbers assigned have
an order or rank; that is, a ranking of “4” is better than a ranking of “2.”



---

Salary Dataset of 52 professors having categorical columns. Apply dummy variables concept and one-hot-encoding on categorical columns.

Dataset Link- Click here

# Importing Libraries

In [17]:
import pandas as pd
df = pd.read_csv("https://data.princeton.edu/wws509/datasets/salary.dat",  delim_whitespace = True)
df

        sx         rk  yr         dg  yd     sl
0     male       full  25  doctorate  35  36350
1     male       full  13  doctorate  22  35350
2     male       full  10  doctorate  23  28200
3   female       full   7  doctorate  27  26775
4     male       full  19    masters  30  33696
5     male       full  16  doctorate  21  28516
6   female       full   0    masters  32  24900
7     male       full  16  doctorate  18  31909
8     male       full  13    masters  30  31850
9     male       full  13    masters  31  32850
10    male       full  12  doctorate  22  27025
11    male  associate  15  doctorate  19  24750
12    male       full   9  doctorate  17  28200
13    male  associate   9    masters  27  23712
14    male       full   9  doctorate  24  25748
15    male       full   7  doctorate  15  29342
16    male       full  13  doctorate  20  31114
17    male  associate  11    masters  14  24742
18    male  associate  10    masters  15  22906
19    male       full   6    masters  21  24450
20    male  assistant  16    masters  23  19175
21    male  associate   8    masters  31  20525
22    male       full   7  doctorate  13  27959
23  female       full   8  doctorate  24  38045
24    male  associate   9  doctorate  12  24832
25    male       full   5  doctorate  18  25400
26    male  associate  11  doctorate  14  24800
27  female       full   5  doctorate  16  25500
28    male  associate   3    masters   7  26182
29    male  associate   3    masters  17  23725
30  female  assistant  10    masters  15  21600
31    male  associate  11    masters  31  23300
32    male  assistant   9    masters  14  23713
33  female  associate   4    masters  33  20690
34  female  associate   6    masters  29  22450
35    male  associate   1  doctorate   9  20850
36  female  assistant   8  doctorate  14  18304
37    male  assistant   4  doctorate   4  17095
38    male  assistant   4  doctorate   5  16700
39    male  assistant   4  doctorate   4  17600
40    male  assistant   3  doctorate   4  18075
41    male  assistant   3    masters  11  18000
42    male  associate   0  doctorate   7  20999
43  female  assistant   3  doctorate   3  17250
44    male  assistant   2  doctorate   3  16500
45    male  assistant   2  doctorate   1  16094
46  female  assistant   2  doctorate   6  16150
47  female  assistant   2  doctorate   2  15350
48    male  assistant   1  doctorate   1  16244
49  female  assistant   1  doctorate   1  16686
50  female  assistant   1  doctorate   1  15000
51  female  assistant   0  doctorate   2  20300

In [18]:
df.dtypes

sx    object
rk    object
yr     int64
dg    object
yd     int64
sl     int64
dtype: object

In [19]:
df.columns

Index(['sx', 'rk', 'yr', 'dg', 'yd', 'sl'], dtype='object')

In [20]:
df.shape

(52, 6)

In [21]:
df.size

312

In [22]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 52 entries, 0 to 51
Data columns (total 6 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   sx      52 non-null     object
 1   rk      52 non-null     object
 2   yr      52 non-null     int64
 3   dg      52 non-null     object
 4   yd      52 non-null     int64
 5   sl      52 non-null     int64
dtypes: int64(3), object(3)
memory usage: 2.6+ KB

In [23]:
df.describe()

              yr         yd            sl
count  52.000000  52.000000     52.000000
mean    7.480769  16.115385  23797.653846
std     5.507536  10.222340   5917.289154
min     0.000000   1.000000  15000.000000
25%     3.000000   6.750000  18246.750000
50%     7.000000  15.500000  23719.000000
75%    11.000000  23.250000  27258.500000
max    25.000000  35.000000  38045.000000

In [24]:
df.nunique()

sx     2
rk     3
yr    18
dg     2
yd    29
sl    51
dtype: int64

# Dummies

In [25]:
dummies = pd.get_dummies(df, columns=['sx', 'rk', 'dg'])
dummies.head()

   yr  yd     sl  sx_female  ...  rk_associate  rk_full  dg_doctorate  dg_masters
0  25  35  36350          0  ...             0        1             1           0
1  13  22  35350          0  ...             0        1             1           0
2  10  23  28200          0  ...             0        1             1           0
3   7  27  26775          1  ...             0        1             1           0
4  19  30  33696          0  ...             0        1             0           1

[5 rows x 10 columns]

# Label Encoding

In [27]:
from sklearn.preprocessing import LabelEncoder
le = LabelEncoder()

In [30]:
newdf = df
newdf.rk = le.fit_transform(newdf.rk)
newdf.head()

       sx  rk  yr         dg  yd     sl
0    male   2  25  doctorate  35  36350
1    male   2  13  doctorate  22  35350
2    male   2  10  doctorate  23  28200
3  female   2   7  doctorate  27  26775
4    male   2  19    masters  30  33696

In [31]:
newdf1 = df
newdf1.sx = le.fit_transform(newdf.sx)
newdf1.head()

   sx  rk  yr         dg  yd     sl
0   1   2  25  doctorate  35  36350
1   1   2  13  doctorate  22  35350
2   1   2  10  doctorate  23  28200
3   0   2   7  doctorate  27  26775
4   1   2  19    masters  30  33696

In [32]:
newdf2 = df
newdf2.dg = le.fit_transform(newdf.dg)
newdf2.head()

   sx  rk  yr  dg  yd     sl
0   1   2  25   0  35  36350
1   1   2  13   0  22  35350
2   1   2  10   0  23  28200
3   0   2   7   0  27  26775
4   1   2  19   1  30  33696

# One hot encoding

In [35]:
from sklearn.preprocessing import OneHotEncoder
from sklearn.compose import ColumnTransformer

ct = ColumnTransformer([("encoder", OneHotEncoder(), [0,1,3])], remainder="passthrough")
newct = ct.fit_transform(df)
newct[:5]

array([[0.0000e+00, 1.0000e+00, 0.0000e+00, 0.0000e+00, 1.0000e+00,
        1.0000e+00, 0.0000e+00, 2.5000e+01, 3.5000e+01, 3.6350e+04],
       [0.0000e+00, 1.0000e+00, 0.0000e+00, 0.0000e+00, 1.0000e+00,
        1.0000e+00, 0.0000e+00, 1.3000e+01, 2.2000e+01, 3.5350e+04],
       [0.0000e+00, 1.0000e+00, 0.0000e+00, 0.0000e+00, 1.0000e+00,
        1.0000e+00, 0.0000e+00, 1.0000e+01, 2.3000e+01, 2.8200e+04],
       [1.0000e+00, 0.0000e+00, 0.0000e+00, 0.0000e+00, 1.0000e+00,
        1.0000e+00, 0.0000e+00, 7.0000e+00, 2.7000e+01, 2.6775e+04],
       [0.0000e+00, 1.0000e+00, 0.0000e+00, 0.0000e+00, 1.0000e+00,
        0.0000e+00, 1.0000e+00, 1.9000e+01, 3.0000e+01, 3.3696e+04]])



---